cases/flow-around-mounted-cylinder-controlled/fluid-openfoam/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    outlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    cylinder
    {
        type            calculated;
        value           $internalField;
    }
    
    jet1
    {
        type            fixedValue;
        value           $internalField;
    }
    
    jet2
    {
        type            fixedValue;
        value           $internalField;
    }
    
    upperWall
    {
        type            slip;
    }

    lowerWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}
