cases/flow-around-mounted-cylinder-controlled/fluid-openfoam/system/flowRateJet1
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/flowRate/flowRatePatch.cfg"

name    jet1;


// ************************************************************************* //